Documents/ИзменениеАссортимента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИзменениеАссортимента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОграничениеАссортимента</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВводаВАссортимент</Name>
					<Comment>Дата ввода товар в ассортимент</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеАссортимента</v8:Type>
						<v8:Type>cfg:DocumentRef.АссортиментныйКомитет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйАссортимент</Name>
							<Comment>Товар вводится в базовый ассортимет</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАссортимента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыАссортимента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеПлощадки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТорговаяПлощадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ИзменениеАссортимента/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
	
	#Область ОбработчикиСобытий
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		
		ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
		
		// Запрещено редактировать документ введенный на основании "АссортиментныйКомитет"
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.АссортиментныйКомитет") Тогда 
			Отказ = НЕ (РольДоступна("ПолныеПрава") ИЛИ ДополнительныеСвойства.Свойство("ОбрабткаЗаданием"));
			//ВызватьИсключение НСтр("ru = 'Документ созданный Ассортиментным Комитетом, редактировать запрещено!'; uk = 'Документ створений Асортиментним Комітетом, редагувати заборонено!'");
		КонецЕсли;
		
		
	КонецПроцедуры
	
	Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		Если ЭтоНовый() Тогда
			ИнициализироватьДокумент(ДанныеЗаполнения);
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		//ПроверяемыеРеквизиты.Добавить("ТорговыеПлощадки");
		Если ОбщегоНазначенияТК.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект,ПроверяемыеРеквизиты) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		
		
	КонецПроцедуры
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		//Отказ = ТорговыеПлощадки.Количество() = 0;
		
		ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		Документы.ИзменениеАссортимента.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
		
		АссортиментСервер.ОтразитьАссортимент(ДополнительныеСвойства, Движения, Отказ);
		
		ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
		
		
		
	КонецПроцедуры
	
	Процедура ПриКопировании(ОбъектКопирования)
		ДокументОснование = "";	//	Тихий
	КонецПроцедуры
	
	#КонецОбласти
	
	
	
	
	
	
	
	
	#Область ИнициализацияИЗаполнение
	
	// Инициализирует документ
	//
	Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
		
		Автор				  = Пользователи.ТекущийПользователь();
		ДатаВводаВАссортимент = НачалоДня(ТекущаяДатаСеанса());
		ХозОперация	 		  = Справочники.ХозОперации.ВводТоваровВАссортимент;
		ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
		
	КонецПроцедуры
	
	
	#КонецОбласти
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
#КонецЕсли
